Repository: openstack/neutron-fwaas-dashboard
Catalog: neutron_fwaas_dashboard/locale/*/LC_MESSAGES/django.po
Languages: fr, zh_cn

source: ALLOW
fr: AUTORISER
zh_cn: 允许

# Action Name of a Firewall Rule
source: ALLOW
fr: AUTORISER
zh_cn: 允许

# Action name of a firewall rule
source: ALLOW
fr: AUTORISER
zh_cn: 允许

source: ANY
fr: TOUT
zh_cn: 任意选项

source: Action
zh_cn: 操作

source: Action for the firewall rule
fr: Action pour la règle de pare-feu
zh_cn: 针对防火墙规则的操作

# Current status of a Firewall Group
source: Active
fr: Actif
zh_cn: 运行中

# Current status of a firewall
source: Active
fr: Actif
zh_cn: 运行中

source: Add
fr: Ajouter
zh_cn: 添加

source: Add Firewall
fr: Ajouter un pare-feu
zh_cn: 添加防火墙

source: Add Firewall Group
fr: Ajouter un groupe de pare-feux
zh_cn: 添加防火墙组

source: Add New Firewall
fr: Ajouter un nouveau pare-feu
zh_cn: 添加新的防火墙

source: Add New Firewall Group
zh_cn: 添加新的防火墙组

source: Add New Policy
fr: Ajouter une nouvelle stratégie
zh_cn: 添加新的策略

source: Add New Rule
fr: Ajouter une nouvelle règle
zh_cn: 添加新的规则

source: Add Policy
fr: Ajouter une stratégie
zh_cn: 添加策略

source: Add Port
zh_cn: 添加端口

source: Add Port to Firewall Group
zh_cn: 为防火墙组添加端口

source: Add Router
fr: Ajouter un routeur
zh_cn: 添加路由器

source: Add Router to Firewall
fr: Ajouter un routeur au pare-feu
zh_cn: 将路由器添加至防火墙

source: Add Routers
fr: Ajouter des routeurs
zh_cn: 添加路由器

source: Add Rule
fr: Ajouter une règle
zh_cn: 增加规则

source: Add port to FirewallGroup {{ name }}
zh_cn: 为防火墙组添加端口 {{ name }}

source: Add selected router(s) to the firewall.
fr: Ajouter le ou les routeurs sélectionnés au pare-feu.
zh_cn: 将所选路由器添加至防火墙。

source: Added Firewall Group"%s".
zh_cn: 添加防火墙组 "%s"。

source: Added Policy "%s".
fr: Stratégie "%s" ajoutée.
zh_cn: 添加策略 “%s”。

source: Added Rule "%s".
fr: Règle "%s" ajoutée.
zh_cn: 已添加规则 “%s”。

source: Added firewall "%s".
fr: Pare-feu "%s" ajouté.
zh_cn: 防火墙 "%s" 已添加。

source: Added policy "%s".
fr: Stratégie "%s" ajoutée.
zh_cn: 已添加策略 “%s”。

source: Added rule "%s".
fr: Règle "%s" ajoutée.
zh_cn: 已添加的规则 "%s"。

source: Admin State
fr: État Administateur
zh_cn: 管理员状态

source: Admin State Up
fr: Etat Admin activé
zh_cn: 管理状态为启动

source: After
fr: Après
zh_cn: 晚于

source: Associated Routers
fr: Routeurs associés
zh_cn: 已关联路由器

source: Audited
fr: Audité
zh_cn: 已审计

source: Available Ports
fr: Ports disponibles
zh_cn: 可用的端口

source: Available Routers
fr: Routeurs disponibles
zh_cn: 可用路由

source: Available Rules
fr: Règles disponibles
zh_cn: 可用的规则

source: Before
fr: Avant
zh_cn: 早于

source: Choose port(s) from Available Ports.
zh_cn: 从可用端口列表中选择。

source: Choose router(s) from Available Routers to Selected Routers by push button or drag and drop.
fr: Choisir les routeur(s) en les déplaçant de Routeurs Disponibles vers les Routeurs Sélectionnés en cliquant sur le bouton ou par glisser-déposer.
zh_cn: 通过按钮或者拖放来从可用路由中选择一个(或多个)到选定路由。

source: Choose rule(s) from Available Rules to Selected Rule by push button or drag and drop, you may change their order by drag and drop as well.
fr: Choisissez une ou plusieurs règles en les faisant passer des règles disponibles aux règles sélectionnées en cliquant sur le bouton ou par glisser-déposer. Vous pouvez aussi changer l'ordre des règles par glisser-déposer.
zh_cn: 通过按下按钮或者拖放从可用策略中选择一个（或多个）添加至选定策略，您也可以利用拖放改变它们的顺序。

source: Choose the router(s) you want to add.
fr: Choisir le(s) routeur(s) que vous voulez ajouter.
zh_cn: 选择需要添加的路由。

source: Choose the rule you want to insert. Specify either the rule you want to insert immediately before, or the rule to insert immediately after. If both are specified, the prior takes precedence.
fr: Choisissez la règle que vous souhaitez insérer. Spécifiez la règle qui doit précéder immédiatement votre nouvelle règle, ou la règle qui doit suivre immédiatement votre nouvelle règle. Si vous spécifiez les deux, le premier critère est prioritaire.
zh_cn: 选择希望插入的规则。 指定在某条规则之前插入，或在某条规则之后插入。如果二者均被指定，前面指定的优先。

source: Choose the rule you want to remove.
fr: Choisissez la règle que vous voulez enlever.
zh_cn: 选择希望移除的规则。

source: Create Firewall
fr: Créer un pare-feu
zh_cn: 创建防火墙

source: Create Firewall Group
zh_cn: 创建防火墙组

source: Create a Firewall Group with selected ports.
fr: Créer un groupe de pare-feux avec les ports sélectionnés.
zh_cn: 创建带有所选端口的路由器组。

source: Create a firewall based on a policy. A firewall represents a logical firewall resource that a tenant can instantiate and manage. A firewall must be associated with one policy, all other fields are optional.
fr: Créer un pare-feu basé sur une stratégie. Un pare-feu représente une ressource de pare-feu logique pouvant être instanciée et gérée par un locataire. Un pare-feu doit être associé à une stratégie, toutes les autres zones sont facultatives.
zh_cn: 根据策略创建防火墙。 防火墙表示租户可以实例化和管理的逻辑防火墙资源。一个防火墙必须与一个策略相关联，所有其它字段是可选字段。

source: Create a firewall group based on a policy. A firewall represents a logical firewall resource that a tenant can instantiate and manage. A firewall must be associated with one policy, all other fields are optional.
zh_cn: 根据策略创建防火墙组。 防火墙表示租户可以实例化和管理的逻辑防火墙资源。一个防火墙必须与一个策略相关联，所有其它字段是可选字段。

source: Create a firewall policy with an ordered list of firewall rules. A firewall policy is an ordered collection of firewall rules. So if the traffic matches the first rule, the other rules are not executed. If the traffic does not match the current rule, then the next rule is executed. A firewall policy has the following attributes: <li>Shared: A firewall policy can be shared across tenants. Thus it can also be made part of an audit workflow wherein the firewall policy can be audited by the relevant entity that is authorized.</li><li>Audited: When audited is set to True, it indicates that the firewall policy has been audited. Each time the firewall policy or the associated firewall rules are changed, this attribute will be set to False and will have to be explicitly set to True through an update operation.</li> The name field is required, all others are optional.
fr: Créer une stratégie de pare-feu avec une liste ordonnée de règles de pare-feu. Une stratégie de pare-feu est un ensemble ordonné de règles de pare-feu. Si le trafic correspond à la première règle, les autres règles ne sont pas exécutées. Si le trafic ne correspond pas à la règle en cours, la règle suivante est exécutée. Une stratégie de pare-feu comporte les attributs suivants : <li>Partagé (shared) : Une stratégie de pare-feu peut être partagée entre locataires. Elle peut ainsi faire partie d'un flux de travaux d'audit au sein duquel la stratégie de pare-feu peut être auditée par l'entité appropriée autorisée.</li><li>Audité (audited) : Lorsque l'attribut est défini sur True, la stratégie de pare-feu a été auditée. Chaque fois qu'une stratégie de pare-feu ou les règles de pare-feu associées sont modifiées, cet attribut est défini sur False et devra être explicitement défini avec la valeur True via une opération de mise à jour.</li> La zone de nom est obligatoire, toutes les autres sont facultatives.
zh_cn: 使用有序防火墙规则列表创建防火墙策略。 防火墙策略是防火墙规则的有序集合。所以，如果流量满足第一个规则，那么其它规则将不会执行。如果流量与当前规则不匹配，那么将执行下一个规则。防火墙策略具有以下属性： <li>Shared：防火墙规则可以在租户间共享。因此，它可以作为审计工作流的一部分，已被授权的相关实体可对该防火墙策略进行审计。</li><li>Audited：当 Audited 设置为 True 时，表示已审计该防火墙策略。每次防火墙策略或关联防火墙规则发生变化时，此属性将会设置为 False，并且必须通过更新操作显式设置为 True。</li> 名称字段是必填字段，所有其他字段是可选字段。

source: Create a firewall rule. A Firewall rule is an association of the following attributes: <li>IP Addresses: The addresses from/to which the traffic filtration needs to be applied.</li><li>IP Version: The type of IP packets (IP V4/V6) that needs to be filtered.</li><li>Protocol: Type of packets (UDP, ICMP, TCP, Any) that needs to be checked.</li><li>Action: Action is the type of filtration required, it can be Reject/Deny/Allow data packets.</li> The protocol and action fields are required, all others are optional.
fr: Créer une règle de pare-feu. Une règle de pare-feu est une association des attributs suivants : <li>Adresses IP : Adresses depuis/vers lesquelles le filtrage du trafic doit s'appliquer.</li><li>Version d'IP : Type des paquets IP (IP V4/V6) à filtrer.</li><li>Protocole : Type des paquets (UDP, ICMP, TCP, Tout) à vérifier.</li><li>Action : Type de filtrage requis ; Il peut s'agir de Rejeter/Refuser/Autoriser les paquets de données.</li> Les zones de protocole et d'action sont obligatoires, toutes les autres sont facultatives.
zh_cn: 创建防火墙规则。 防火墙规则由以下属性关联形成： <li>IP 地址：需要应用流量过滤的来源/目标地址。</li><li>IP版本：需要过滤的 IP 包类型 (IP V4/V6)。</li><li>协议：需要检查的数据包类型（UDP、ICMP、TCP 和 Any）。</li><li>操作：操作是所需过滤类型，它可为拒绝/放弃/允许数据包。</li> 协议字段和操作字段是必填字段，所有其他字段为可选字段。

source: Create a firewall rule. A firewall rule is an association of the following attributes: <li>IP Addresses: The addresses from/to which the traffic filtration needs to be applied.</li><li>IP Version: The type of IP packets (IP V4/V6) that needs to be filtered.</li><li>Protocol: Type of packets (UDP, ICMP, TCP, Any) that needs to be checked.</li><li>Action: Action is the type of filtration required, it can be Reject/Deny/Allow data packets.</li> The protocol and action fields are required, all others are optional.
fr: Créer une règle de pare-feu. Une règle de pare-feu est une association des attributs suivants : <li>Adresses IP : Adresses depuis/vers lesquelles le filtrage du trafic doit s'appliquer.</li><li>Version d'IP : Type des paquets IP (IP V4/V6) à filtrer.</li><li>Protocole : Type des paquets (UDP, ICMP, TCP, Tout) à vérifier.</li><li>Action : Type de filtrage requis ; Il peut s'agir de Rejeter/Refuser/Autoriser les paquets de données.</li> Les zones de protocole et d'action sont obligatoires, toutes les autres sont facultatives.
zh_cn: 创建防火墙规则。 防火墙规则由以下属性关联形成： <li>IP 地址：需要应用流量过滤的来源/目标地址。</li><li>IP版本：需要过滤的 IP 包类型 (IP V4/V6)。</li><li>协议：需要检查的数据包类型（UDP、ICMP、TCP 和 Any）。</li><li>操作：操作是所需过滤类型，它可为拒绝/放弃/允许数据包。</li> 协议字段和操作字段是必填字段，所有其他字段为可选字段。

source: Create a firewall with selected routers.
fr: Créer un pare-feu avec les routeurs sélectionnés.
zh_cn: 创建带有所选路由器的防火墙。

source: Create a policy with selected rules.
fr: Créer une stratégie avec les règles sélectionnées.
zh_cn: 使用所选规则创建策略。

# Current status of a Firewall Group
source: Created
fr: Créé
zh_cn: 已创建

# Current status of a firewall
source: Created
fr: Créé
zh_cn: 已创建

source: DENY
fr: REFUSER
zh_cn: 拒绝

# Action Name of a Firewall Rule
source: DENY
fr: REFUSER
zh_cn: 丢弃

# Action name of a firewall rule
source: DENY
fr: REFUSER
zh_cn: 拒绝

# Admin state of a Firewall Group
source: DOWN
fr: INACTIF
zh_cn: 关闭

# Admin state of a firewall
source: DOWN
fr: INACTIF
zh_cn: 关闭

source: Delete Firewall
fr: Supprimer le pare-feu
zh_cn: 删除防火墙

source: Delete Firewall Group
zh_cn: 删除防火墙组

source: Delete Policy
fr: Supprimer la stratégie
zh_cn: 删除策略

source: Delete Rule
fr: Supprimer la règle
zh_cn: 删除规则

source: Description
zh_cn: 描述

source: Description:
zh_cn: 描述：

source: Destination IP
fr: IP de destination
zh_cn: 目标 IP

source: Destination IP Address
fr: Adresse IP de destination
zh_cn: 目的 IP 地址

source: Destination IP Address/Subnet
fr: Adresse IP/Sous-réseau de destination
zh_cn: 目标 IP 地址/子网

source: Destination IP address or subnet
fr: Adresse IP ou sous-réseau de destination
zh_cn: 目标 IP 地址或子网

source: Destination Port
fr: Port de destination
zh_cn: 目标端口

source: Destination Port/Port Range
fr: Port/Plage de ports de destination
zh_cn: 目标端口/端口范围

source: Destination port (integer in [1, 65535] or range in a:b)
fr: Port de destination (entier compris dans [1, 65535] ou plage a:b)
zh_cn: 目标端口（[1, 65535] 区间内的整数或者以 a:b 形式表示的范围）

# Current status of a Firewall Group
source: Down
fr: Inactif
zh_cn: 关闭

# Current status of a firewall
source: Down
fr: Inactif
zh_cn: 关闭

source: Edit Firewall
fr: Éditer le pare-feu
zh_cn: 编辑防火墙

source: Edit Firewall Group
zh_cn: 编辑防火墙组

source: Edit Firewall {{ name }}
fr: Editer le pare-feu {{ name }}
zh_cn: 编辑防火墙 {{ name }}

source: Edit FirewallGroup {{ name }}
zh_cn: 编辑防火墙组 {{ name }}

source: Edit Policy
fr: Editer la stratégie
zh_cn: 编辑策略

source: Edit Policy {{ name }}
fr: Editer la stratégie {{ name }}
zh_cn: 编辑策略 {{ name }}

source: Edit Rule
fr: Éditer la règle
zh_cn: 编辑规则

source: Edit Rule {{ name }}
fr: Editer la règle {{ name }}
zh_cn: 编辑规则 {{ name }}

source: Egress Policy
fr: Stratégie sortante
zh_cn: 出口策略

source: Egress Policy ID
zh_cn: 出口策略 ID

source: Enable Admin State
fr: État Administratif Actif
zh_cn: 启用管理员状态

source: Enabled
fr: Activé
zh_cn: 已启用

# Current status of a Firewall Group
source: Error
fr: Erreur
zh_cn: 错误

# Current status of a firewall
source: Error
fr: Erreur
zh_cn: 错误

source: Failed to add router(s) to firewall %(name)s: %(reason)s
fr: Echec d'ajout du ou des routeurs au pare-feu %(name)s : %(reason)s
zh_cn: 将路由器添加至防火墙 %(name)s 失败：%(reason)s

source: Failed to insert rule to policy %(name)s: %(reason)s
fr: Echec d'insertion de la règle dans la stratégie %(name)s : %(reason)s
zh_cn: 无法将规则插入至策略 %(name)s：%(reason)s

source: Failed to remove router(s) from firewall %(name)s: %(reason)s
fr: Échec à retirer routeur(s) du pare-feu %(name)s: %(reason)s
zh_cn: 未能从防火墙 %(name)s 中移除路由器：%(reason)s

source: Failed to remove rule from policy %(name)s: %(reason)s
fr: Echec de retrait de la règle de la stratégie %(name)s : %(reason)s
zh_cn: 无法从策略 %(name)s 中移除规则：%(reason)s

source: Failed to retrieve available routers: %s
fr: Échec de la récupération des routeurs disponibles: %s
zh_cn: 无法获取可用的路由器：%s

source: Failed to retrieve available rules: %s
fr: Impossible de récupérer les règles disponibles : %s
zh_cn: 无法检索可用的规则：%s

source: Failed to retrieve current routers in firewall %(name)s: %(reason)s
fr: Échec de la récupération des routeurs dans le pare-feu %(name)s: %(reason)s
zh_cn: 无法检索防火墙 %(name)s 中的当前路由器：%(reason)s

source: Failed to retrieve current rules in policy %(name)s: %(reason)s
fr: Échec de la récupération des règles courantes de la stratégie %(name)s : %(reason)s
zh_cn: 无法检索策略 %(name)s 中的当前规则：%(reason)s

source: Failed to retrieve port list of the firewall group.
zh_cn: 无法获取防火墙组的端口列表。

source: Failed to update firewall %(name)s: %(reason)s
fr: Échec de la mise à jour du pare-feu %(name)s : %(reason)s
zh_cn: 无法更新防火墙 %(name)s：%(reason)s

source: Failed to update firewallgroup %(name)s: %(reason)s
zh_cn: 无法更新防火墙组 %(name)s：%(reason)s

source: Failed to update policy %(name)s: %(reason)s
fr: Echec de mise à jour de la stratégie %(name)s : %(reason)s
zh_cn: 无法更新策略 %(name)s：%(reason)s

source: Failed to update rule %(name)s: %(reason)s
fr: Échec de la mise à jour de la règle %(name)s : %(reason)s
zh_cn: 无法更新规则 %(name)s：%(reason)s

source: Failed to verify extension support %s
zh_cn: 验证扩展支持 %s 失败

source: Firewall
fr: Pare-feu
zh_cn: 防火墙

source: Firewall %s was successfully updated.
fr: Le pare-feu %s a été mis à jour.
zh_cn: 已成功更新防火墙 %s。

source: Firewall Groups
zh_cn: 防火墙组

source: Firewall Policies
fr: Stratégies de pare-feu
zh_cn: 防火墙策略

source: Firewall Rules
fr: Règles de pare-feu
zh_cn: 防火墙规则

source: FirewallGroup
zh_cn: 防火墙组

source: FirewallGroup %s was successfully updated.
zh_cn: 防火墙组 %s 已被成功更新。

source: Firewalls
fr: Pare-feux
zh_cn: 防火墙

source: IP Version
fr: Version d'IP
zh_cn: IP版本

source: IP Version for Firewall Rule
fr: Version d'IP pour la règle de pare-feu
zh_cn: 防火墙规则的 IP 版本

source: In Policy
fr: Stratégies associées
zh_cn: 在策略

# Current status of a Firewall Group
source: Inactive
fr: Inactif
zh_cn: 不活跃

# Current status of a firewall
source: Inactive
fr: Inactif
zh_cn: 失效

source: Ingress Policy
fr: Stratégie entrante
zh_cn: 入口策略

source: Ingress Policy ID
zh_cn: 入口策略 ID

source: Insert Rule
fr: Insérer une règle
zh_cn: 插入规则

source: Insert Rule to Policy
fr: Insérer une règle dans la stratégie
zh_cn: 向策略中添加规则

source: Name
fr: Nom
zh_cn: 名称

source: Non admin users are not allowed to set the shared property of the policy.
zh_cn: 非管理用户不允许设置策略的共享属性。

source: Non admin users are not allowed to set the shared property of the rule.
zh_cn: 非管理用户不允许设置规则的共享属性。

source: None
fr: Aucun
zh_cn: 无

# Current status of a Firewall Group
source: Pending Create
fr: Création en attente
zh_cn: 等待创建

# Current status of a firewall
source: Pending Create
fr: Création en attente
zh_cn: 等待创建

# Current status of a Firewall Group
source: Pending Delete
fr: Suppression en attente
zh_cn: 等待删除

# Current status of a firewall
source: Pending Delete
fr: Suppression en attente
zh_cn: 等待删除

# Current status of a Firewall Group
source: Pending Update
fr: Mise à jour en attente
zh_cn: 等待更新

# Current status of a firewall
source: Pending Update
fr: Mise à jour en attente
zh_cn: 等待更新

source: Policies
fr: Stratégies
zh_cn: 策略

source: Policy
fr: Stratégie
zh_cn: 策略

source: Policy %s was successfully updated.
fr: La stratégie %s a été mise à jour.
zh_cn: 已成功更新策略 %s。

source: Ports
zh_cn: 端口

source: Position in Policy
fr: Position dans la stratégie
zh_cn: 在策略中的位置

source: Project ID
zh_cn: 项目 ID

source: Protocol
fr: Protocole
zh_cn: 协议

source: Protocol for the firewall rule
fr: Protocole pour la règle de pare-feu
zh_cn: 防火墙规则的协议

source: REJECT
fr: REJETER
zh_cn: 拒绝

# Action Name of a Firewall Rule
source: REJECT
fr: REJETER
zh_cn: 拒绝

# Action name of a firewall rule
source: REJECT
fr: REJETER
zh_cn: 拒绝

source: Remove Port
fr: Supprimer le port
zh_cn: 删除端口

source: Remove Port from Firewall Group
zh_cn: 为防火墙组删除端口

source: Remove Router
fr: Supprimer le routeur
zh_cn: 删除路由器

source: Remove Router from Firewall
fr: Retirer un routeur du pare-feu
zh_cn: 从防火墙中删除路由器

source: Remove Rule
fr: Retirer la règle
zh_cn: 移除规则

source: Remove Rule from Policy
fr: Retirer une règle de la stratégie
zh_cn: 从策略中移除规则

source: Remove port from FirewallGroup {{ name }}
zh_cn: 从防火墙组中删除端口 {{ name }}

source: Router(s) was successfully removed from firewall %(firewall)s.
fr: Le ou les routeurs ont été retirés du pare-feu %(firewall)s.
zh_cn: 已成功从防火墙 %(firewall)s 中移除路由器。

source: Router(s) was/were successfully added to firewall %(firewall)s.
fr: Le ou les routeurs ont été ajoutés au pare-feu %(firewall)s.
zh_cn: 路由器已经成功添加至以下防火墙：%(firewall)s。

source: Routers
fr: Routeurs
zh_cn: 路由器

source: Rule
fr: Règle
zh_cn: 规则

source: Rule %(rule)s was successfully inserted to policy %(policy)s.
fr: La règle %(rule)s a été insérée dans la stratégie %(policy)s.
zh_cn: 规则 %(rule)s 被成功插入至策略 %(policy)s。

source: Rule %(rule)s was successfully removed from policy %(policy)s.
fr: La règle %(rule)s a été retirée de la stratégie %(policy)s.
zh_cn: 规则 %(rule)s 已从策略 %(policy)s 中成功移除。

source: Rule %s was successfully updated.
fr: La règle %s a été mise à jour.
zh_cn: 已成功更新规则 %s。

source: Rules
fr: Règles
zh_cn: 规则

source: Save Changes
fr: Enregistrer les changements
zh_cn: 保存变更

source: Scheduled deletion of Firewall Group
zh_cn: 已调度的删除防火期组

source: Scheduled deletion of Policy
fr: Suppression planifiée de la stratégie
zh_cn: 已安排删除策略

source: Scheduled deletion of Rule
fr: Suppression planifiée de la règle
zh_cn: 已安排删除规则

source: Scheduled deletion of firewall
zh_cn: 已调度删除防火墙

source: Scheduled deletion of policy
zh_cn: 已安排删除策略

source: Scheduled deletion of rule
zh_cn: 已安排删除规则

source: Select a Policy
fr: Sélectionner une stratégie
zh_cn: 选择策略

source: Select a policy
fr: Sélectionner une stratégie
zh_cn: 选择一个策略

source: Select ports for your firewall group.
zh_cn: 为防火墙组选择端口。

source: Select routers for your firewall.
fr: Sélectionnez des routeurs pour votre pare-feu.
zh_cn: 为您的防火墙选择路由器。

source: Select rules for your policy.
fr: Sélectionnez des règles pour votre stratégie.
zh_cn: 为您的策略选择规则。

source: Selected Ports
zh_cn: 选择的端口

source: Selected Routers
fr: Routeurs sélectionnés
zh_cn: 选择的路由

source: Selected Rules
fr: Règles sélectionnées
zh_cn: 选定的规则

source: Shared
fr: Partagé
zh_cn: 共享

source: Source IP
fr: IP source
zh_cn: 源 IP

source: Source IP Address
fr: Adresse IP source
zh_cn: 源 IP 地址

source: Source IP Address/Subnet
fr: Adresse IP/Sous-réseau source
zh_cn: 源 IP 地址/子网

source: Source IP address or subnet
fr: Adresse IP ou sous-réseau source
zh_cn: 源 IP 地址或子网

source: Source Port
fr: Port source
zh_cn: 源端口

source: Source Port/Port Range
fr: Port/plage de ports source
zh_cn: 源端口/端口范围

source: Source port (integer in [1, 65535] or range in a:b)
fr: Port source (entier compris dans [1,65535] ou plage a:b)
zh_cn: 源端口（[1, 65535] 区间内的整数或者以 a:b 形式表示的范围）

source: Source/Destination Network Address and IP version are inconsistent. Please make them consistent.
fr: La version d'IP et l'adresse réseau source/de destination ne sont pas cohérentes. Corrigez-les en conséquence.
zh_cn: 源/目标网络地址和 IP 版本不一致。请确保它们一致。

source: Status
fr: Statut
zh_cn: 状态

# Admin state of a Firewall Group
source: UP
fr: ACTIF
zh_cn: 启动

# Admin state of a firewall
source: UP
fr: ACTIF
zh_cn: 启动

source: Unable to add Firewall Group "%s".
zh_cn: 无法添加防火墙组 "%s"。

source: Unable to add Policy "%s".
fr: Impossible d'ajouter la stratégie "%s".
zh_cn: 无法添加策略 “%s”。

source: Unable to add Rule "%s".
fr: Impossible d'ajouter la règle "%s".
zh_cn: 无法添加规则 “%s”。

source: Unable to add firewall "%s".
fr: Impossible d'ajouter le pare-feu "%s".
zh_cn: 无法添加防火墙 "%s"。

source: Unable to add policy "%s".
fr: Impossible d'ajouter la stratégie "%s".
zh_cn: 无法添加策略 “%s”。

source: Unable to add rule "%s".
fr: Impossible d'ajouter la règle "%s".
zh_cn: 无法添加规则 "%s"。

source: Unable to delete firewall. %s
fr: Impossible de supprimer le pare-feu %s
zh_cn: 无法删除防火墙 %s

source: Unable to delete policy. %s
fr: Impossible de supprimer la stratégie. %s
zh_cn: 无法删除策略 %s

source: Unable to delete rule. %s
fr: Impossible de supprimer la règle %s
zh_cn: 无法删除规则 %s

source: Unable to retrieve firewall details.
fr: Impossible de récupérer les détails du pare-feu.
zh_cn: 无法检索防火墙详情。

source: Unable to retrieve firewall list.
fr: Impossible de récupérer la liste des pare-feux.
zh_cn: 无法检索防火墙列表。

source: Unable to retrieve firewallgroup details.
zh_cn: 无法获取防火墙组详情。

source: Unable to retrieve policies list.
fr: Impossible de récupérer la liste des stratégies.
zh_cn: 无法检索策略列表。

source: Unable to retrieve policy details.
fr: Impossible de récupérer les détails de la stratégie.
zh_cn: 无法检索策略详情。

source: Unable to retrieve policy list (%(error)s).
fr: Impossible de récupérer la liste des stratégies (%(error)s).
zh_cn: 无法检索策略列表 (%(error)s)。

source: Unable to retrieve policy list (%s).
fr: Impossible de récupérer la liste des stratégies (%s).
zh_cn: 无法检索策略列表 (%s)。

source: Unable to retrieve policy list.
fr: Impossible de récupérer la liste des stratégies.
zh_cn: 无法检索策略列表。

source: Unable to retrieve port list.
fr: Impossible de récupérer la liste des ports.
zh_cn: 无法获取端口列表。

source: Unable to retrieve ports (%s).
fr: Impossible de récupérer les ports (%s).
zh_cn: 无法获取端口 (%s)。

source: Unable to retrieve routers (%(error)s).
fr: Impossible de récupérer les routeurs (%(error)s).
zh_cn: 无法检索路由器 (%(error)s)。

source: Unable to retrieve rule details.
fr: Impossible de récupérer les détails de la règle.
zh_cn: 无法检索规则详情。

source: Unable to retrieve rules (%(error)s).
fr: Impossible de récupérer les règles (%(error)s).
zh_cn: 无法检索规则 (%(error)s)。

source: Unable to retrieve rules (%s).
fr: Impossible de récupérer les règles (%s).
zh_cn: 无法获取规则 (%s)。

source: Unable to retrieve rules list.
fr: Impossible de récupérer la liste des règles.
zh_cn: 无法检索规则列表。

source: Unselect the router(s) to be removed from firewall.
fr: Désélectionner le ou les routeurs à retirer du pare-feu.
zh_cn: 取消选中要从防火墙中移除的路由器。

source: Unselect the routers you want to disassociate from the firewall.
fr: Désélectionner les routeurs que vous voulez dissocier du pare-feu.
zh_cn: 取消选择需要从防火墙中分离的路由。

source: Used in Policy
fr: Utilisée dans la stratégie
zh_cn: 已使用在策略

source: You may add ports to firewall group here.
zh_cn: 您可以在这里为防火墙组添加端口。

source: You may remove ports from firewall group here.
zh_cn: 您可以在这里为防火墙组删除端口。

source: You may update firewall details here.
fr: Ici, vous pouvez mettre à jour les détails du pare-feu.
zh_cn: 您可以在此处更新防火墙详情。

source: You may update firewall group details here.
zh_cn: 您可以在此处更新防火墙组的详情。
