Repository: openstack/neutron-fwaas-dashboard
Catalog: neutron_fwaas_dashboard/locale/*/LC_MESSAGES/django.po
Languages: fr, zh_cn

source: You may update policy details here. Use 'Insert Rule' or 'Remove Rule' links instead to insert or remove a rule
fr: Mettez à jour les détails de la stratégie ici. Utilisez les liens 'Insérer une règle' ou 'Enlever une règle' pour insérer ou enlever une règle.
zh_cn: 您可以在此处更新策略详情。使用'插入规则'或'移除规则'链接来插入或删除规则。

source: You may update policy details here. Use 'Insert Rule' or 'Remove Rule' links instead to insert or remove a rule.
zh_cn: 您可以在此处更新策略详情。使用'插入规则'或'移除规则'链接来插入或删除规则。

source: You may update rule details here.
fr: Ici, vous pouvez mettre à jour les détails de la règle.
zh_cn: 您可以在此处更新规则详情。
